---
type: PolylineNode
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# PolylineNode

`Autodesk.Revit.DB.PolylineNode` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetPolyline | 2016 | `public PolyLine GetPolyline ()` |